## EMPLOYEE SALARIES ANALYSIS

Employee salaries refer to the compensation paid to individuals for their work or services rendered to an employer. Salaries are typically expressed as an annual amount, but they may be paid on a monthly, bi-weekly, or weekly basis. Compensation may include base pay, bonuses, benefits, and other perks. The salary structure varies based on factors such as job responsibilities, experience, skills, and industry standards. Employers determine salaries through negotiations, market research, and internal policies, aiming to attract and retain qualified talent while maintaining competitive and fair compensation practices.The Employee Salaries Datasets contains information about various employees, including their names, job titles, base pay, overtime pay, other pay, benefits, total pay, total pay benefits, year, notes, agency, and status.

# Aim:
The aim of this analysis is to gain insights into the Employee Salaries Dataset and extract meaningful information to understand various aspects of employee salaries in San Francisco.

# Objectives:
 The objectives aim to provide a comprehensive overview of the dataset, analyze salary statistics, and gain insights into the distribution of job titles and compensation among employees in San Francisco. The analysis will help in understanding patterns, trends, and key information related to employee salaries.

To initiate the analysis process, the following essential python libraries are imported to facilitate data manipulation, exploration, and visualization.The Python libraries are numpy as np, pandas as pd, matplotlib.pyplot as plt and seaborn as sns.

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Continuing with the analysis, the next step involves importing the Employee Salaries Dataset. The dataset is loaded into a Pandas DataFrame named employees_df using the pd.read_csv() function. To confirm the successful import and get an initial glimpse of the data, the first few rows of the DataFrame are displayed using print(employees_df.head())

In [ ]:
employees_df = pd.read_csv(r"C:\Users\USER\Documents\EXCEL WORK\Salaries.csv")
(employees_df.head())

In [4]:
print(employees_df.shape)

(148654, 13)

In [5]:
The above result shows that the datasets contains 148,654 rows and 13 columns

SyntaxError: invalid syntax (Temp/ipykernel_6592/199749486.py, line 1)

To examine the statistical summary of the dataset, we employed the `describe()` function. The resulting summary statistics provide a comprehensive overview of key numerical measures such as mean, standard deviation, minimum, maximum, and quartiles. These metrics offer valuable insights into the central tendencies and variability within the dataset, laying the groundwork for a more in-depth analysis of employee salaries and related attributes.

In [12]:
employees_df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
count,148654.000000,148045.000000,148650.000000,148650.000000,112491.000000,148654.000000,148654.000000,148654.000000,0.0,0.0
mean,74327.500000,66325.448841,5066.059886,3648.767297,25007.893151,74768.321972,93692.554811,2012.522643,NaN,NaN
std,42912.857795,42764.635495,11454.380559,8056.601866,15402.215858,50517.005274,62793.533483,1.117538,NaN,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN,NaN
25%,37164.250000,33588.200000,0.000000,0.000000,11535.395000,36168.995000,44065.650000,2012.000000,NaN,NaN
50%,74327.500000,65007.450000,0.000000,811.270000,28628.620000,71426.610000,92404.090000,2013.000000,NaN,NaN
75%,111490.750000,94691.050000,4658.175000,4236.065000,35566.855000,105839.135000,132876.450000,2014.000000,NaN,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN,NaN

Concluding the initial steps of data pre-processing, we utilized the `info()` method to gain insights into the dataset's structure, including data types, non-null counts, and memory usage. Subsequently, the obtained information guided the implementation of appropriate data cleaning processes. Addressing any missing values, ensuring consistent data types, and handling anomalies are essential components of this data cleaning phase, setting the stage for a more robust and accurate analysis of the Employee Salaries Dataset.

In [13]:
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

The summary of the dataset obtained from the `info()` method is as follows:

The Employee Salaries Dataset consists of 13 columns with identifiers ranging from 0 to 12. The non-null counts for each column reveal varying degrees of missing values, particularly in columns such as "BasePay," "OvertimePay," "OtherPay," "Benefits," "Notes," and "Status." The data types of the columns provide insights into the nature of the information they hold, with object types for "EmployeeName," "JobTitle," and "Agency," and numerical types (int64 or float64) for quantitative columns.

The "Year" column indicates the calendar years associated with the salary information. Notably, the "Notes" and "Status" columns appear to be entirely populated with missing values, given their zero non-null counts. This initial overview guides the subsequent data cleaning process, highlighting areas where attention is needed, such as handling missing values and potentially adjusting data types.

To eliminate the "Notes" and "Status" columns from the Pandas DataFrame, the following code was implemented:

In [22]:

columns_to_drop = ['Notes', 'Status']
columns_to_drop = [col for col in columns_to_drop if col in employees_df.columns]

employees_df = employees_df.drop(columns=columns_to_drop, errors='ignore')
employees_df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,San Francisco

The use employees_df.head() reveals the modified dataset, showcasing the DataFrame with the specified columns removed.
In this analysis of the Employee Salaries Dataset, the following key steps were performed:

Data Import and Overview:

The dataset, containing information about employees, was imported into a Pandas DataFrame.
Initial exploration using methods like head() and info() provided insights into the structure and content of the dataset.
Data Cleaning:

Unnecessary columns ('Notes' and 'Status') were dropped to streamline the dataset.
Instances of "Not provided" in the 'EmployeeName' column were replaced with NaN.
Rows with exactly 5 missing values were dropped to handle missing data effectively.
Descriptive Analysis:

The occurrence of each unique employee name was determined.
The number of unique job titles and the total number of job titles containing the word 'captain' were found.
Employee names from the fire department were displayed.
Statistical Analysis:

Minimum, maximum, and average base pay were calculated and reported.
The job title and total compensation (including benefits) of "ALBERT PARDINI" were identified.
The person with the highest base pay was determined and their name displayed.
Grouped Analysis:

The average base pay for all employees per job title was calculated and reported.
The average base pay for employees with the job title 'Accountant' was determined.
Common Job Analysis:

The five most common job titles in the dataset were identified and reported.
Conclusion:
This analysis provided valuable insights into the Employee Salaries Dataset, ranging from basic exploratory data analysis to more detailed statistical and grouped analyses. Key findings include salary statistics, common job titles, and specific details about individuals such as "ALBERT PARDINI" and the person with the highest base pay. The code snippets were structured to enhance clarity and maintainability, facilitating a comprehensive understanding of the dataset

In [23]:

employee_name_counts = employees_df['EmployeeName'].value_counts()
print(employee_name_counts)

Kevin Lee                   13
Richard Lee                 11
Steven Lee                  11
William Wong                11
Stanley Lee                  9
                            ..
Jeffrey Skover               1
Ken Dever                    1
Kevin Whitfield              1
Granville McCollough III     1
Joe Lopez                    1
Name: EmployeeName, Length: 110811, dtype: int64

The output above represents the occurrence of employee names in the Employee Salaries Dataset. Each line displays an employee's name followed by the count of occurrences.This information provides insights into the distribution of employee names, highlighting 'kevin'  with higher occurrences in the dataset.

In [39]:
unique_job_titles_count = employees_df['JobTitle'].nunique()
print("The Number of Unique Job Titles is :", unique_job_titles_count)

The Number of Unique Job Titles is : 2159

To find the total number of job titles that contain the word "captain,",the str.contains() method along with sum(). was used and the result is displayed below.

In [40]:
captain_job_titles_count = employees_df['JobTitle'].str.contains('captain', case=False).sum()
print(" The total Number of Job Titles containing 'captain' is:", captain_job_titles_count)

 The total Number of Job Titles containing 'captain' is: 552

In [41]:
fire_department_employees = employees_df[employees_df['JobTitle'].str.lower().str.contains('fire department')]
print("Employee Names from Fire Department are:")
print(fire_department_employees['EmployeeName'].tolist())

Employee Names from Fire Department are:
['PATRICK GARDNER', 'ALSON LEE', 'MICHAEL MORRIS', 'JOANNE HAYES-WHITE', 'ARTHUR KENNEY', 'DAVID FRANKLIN', 'MARTY ROSS', 'VICTOR WYRSCH', 'RAYMOND GUZMAN', 'MONICA FIELDS', 'JOSE VELO', 'BRENDAN WARD', 'MICHAEL THOMPSON', 'THOMAS ABBOTT', 'THOMAS SIRAGUSA', 'BRYAN RUBENSTEIN', 'KEN YEE', 'KIRK RICHARDSON', 'KENNETH SMITH', 'CHARLES CRANE', 'ROBERT POSTEL', 'RICHARD BUSALACCHI', 'KEVIN BURKE', 'EDUARDO GONZALEZ', 'ROBERT WINSLOW', 'LORRIE KALOS', 'MICHAEL BRYANT', 'MARK GONZALES', 'REX HALE', 'KEVIN SMITH', 'KEVIN TAYLOR', 'ERIKA HOO', 'SAMSON LAI', 'KHAIRUL ALI', 'JOHN HICKEY', 'EDWARD CHU', 'ZACHARY PUMPHREY', 'MARK CASTAGNOLA', 'LUIS IBARRA-RIVERA', 'MICHAEL KEARNEY', 'MATTHEW MCNAUGHTON', 'GEORGE LYSENKO', 'ALBERTO PEDRUCO', 'DWAYNE CURRY', 'DENNIS SUTTER', 'ROBERT SERRANO', 'JAMES VANNUCCHI', 'CANTREZ TRIPLETT', 'RYAN KENNEDY', 'JOHN ROCCO', 'EDMUND VAIL', 'ANDREW SAITZ', 'BERGLIOTH MATHEWS', 'PABLO SIGUENZA', 'DANIEL YONTS', 'DAVID THOMPSON', 'JAMES BLAKE', 'RYAN CREAN', 'RUDY CASTELLANOS', 'MICHAEL GONZALES', 'ROBERT LOPEZ', 'JOHN MURPHY', 'KENNETH CORDERO', 'JIM HALL III', 'MARK JOHNSON', 'BRENDAN MCGORRIN', 'WILLIAM MCFARLAND', 'RAEMONA WILLIAMS', 'JEFFREY BARDEN', 'MATTHEW CANNON', 'RICHARD UNTALAN', "DENNIS O'NEILL", 'FLOYD ROLLINS', 'THOMAS KOHMANN', 'RAUL FRANCISCO', 'ALAN REYNAUD', 'DENISE NEWMAN', 'JOHN CREMEN', 'FRANK KOSTA', 'FRANK HSIEH', 'MATTHEW HUTCHINSON', 'DAVID BROWN', 'VINCENT NOLAN', 'CHERISH MURDOCK', 'LARS ASPELIN', 'JORGE PLATA', 'ANESTO ESTRELLA', 'KENNETH HUPKE', 'RONALD LEWIN', 'JOSEPH SCHIEBOLD', 'CHRISTINE EMMONS', 'DONALD GOGGIN', 'ANTHONY BENDIK', 'NORMAN CABA', 'SEAN MCKINNEY', 'ERNEST CARRILLO', 'MATTHEW SCHWARTZ', 'ALEXANDER DOUGLAS JR', 'DUSTIN WINN', 'ERIC LEAL', 'DENNIS SULLIVAN', 'PATRICK RABBITT', 'JOSEPH BARBERO', 'ANNE TAM', 'CHRISTOPHER MADSEN', 'JEANINE NICHOLSON', 'JAMES DRAPER', 'TERRY SMERDEL', 'CHARLES MC COY', 'RANDALL HIRO', 'LLOYD GOLDBERG', 'AISHA KRIEGER', 'CHASE WILSON', 'TYSON YEE', 'ALLEN WONG', 'BRIAN WALSH', "PAUL O'KANE", 'PAUL MCDONAGH', 'JANEEN PIROSKO', 'ROBERT ARZAVE', 'RUBEN MONTERO', 'DAVID MURRAY', 'KAREN HEALD', 'GERALD SCULLION', 'JENNIFER MATHEWS', 'DARIUS LUTTROPP', 'NEAL CAVELLINI', 'JIRO YAMAMOTO', 'JOEL SATO', 'KYLE MERKINS', 'JEFFREY WONG', 'DOMINIC OTTOBONI', 'ANGELA ROMERO', 'JOHN GRANT', 'DAVID RITTER', 'WALTER VILLAVICENCIO', 'KEVIN PARDINI', 'MARC KASPER', 'JOE CHAN', 'CRISTEO REYES', 'MICHAEL MALONEY', 'DAVID SMILEY', 'ETHAN JACKSON', 'MICHAEL CHARLTON', "PATRICK D'ARCY", 'LAWRENCE CONRAD', 'MICHAEL BARRY', 'STEPHEN CASSIDY', 'ROBERT KISHI', 'TIMOTHY FARMER', 'BRICE PEOPLES', 'DAWN DEWITT', 'HEATHER PIPER', 'MARC EVANS', 'AARON STEVENSON', 'EUGENE ADAMS', 'CATHERINE EMMONS-SAMSON', 'BRENT STUCKERT', 'KENNETH JONES', 'MICHAEL DUNCAN', 'MATTHEW LEE', 'ANTHONY RIVERA', 'ANSON WU', 'HERMAN WOO', 'THERESA WOLOWIC', 'PETER GROSS', 'JAMES REIDY', 'THERESA KWAN', 'ANTHONY SMERDEL', 'RICKY YEE', 'ERICA ARTESEROS', 'ROBERT TURNQUIST', 'SEAN MULLANE', 'WAYNE WONG', 'MICHAEL FUCCIOLO', 'KATHY AUSTIN', 'BROCK WELLS', 'KIMBERLY MC KEON', 'RAMON SERRANO', 'GREGORY BLATMAN', 'PATRICK SULLIVAN', 'SEAN JOHNSTON', 'KEVIN MC KEON', 'THOMAS OERTLI', 'CHRISTOPHER BENZ', 'JUSTIN BROWN', 'CYNTHIA RICKERT', 'CHADWICK ERTOLA', 'CECILIA JIANG', 'JOHN CHUNG', 'JOHN LOPES', 'ROBERT NEUNEKER', 'DANIEL GRIFFIN', 'SHIRLEY SZELA', 'KAREN KERR', 'STEPHEN MC PARTLAN', 'ROBERT MCDONALD', 'JAMES APP', 'ROBERT ZLATUNICH', 'FREDERICK PUTT', 'SHANE FRANCISCO', 'ALAN WONG', 'CLIFTON MERRILL', 'KENNETH LINNEY', 'ANTHONY GARIBALDI', 'MARK HARDEMAN', 'DAT TRUONG', 'DWAYNE NEWTON', 'ALISON YEE', 'LEONEL TINGIN', 'RONALD VANPOOL', 'LESLIE WONG', 'HELEN KIEFFER', 'ROBERT CAPPA', 'SETH RUBENSTEIN', 'PATRICIA LUI', 'PATRICK MARTINEZ', 'AUDRY LEE', 'VINCENT PEREZ', 'JENSEN RHODES', 'AARON STEVENSON', 'JAMES BARDEN', 'Joanne Hayes-White', 'Joanne M Hayes-White', 'Robert E Evans', 'Joanne M Hayes-White']

In [42]:
min_basepay = employees_df['BasePay'].min()
max_basepay = employees_df['BasePay'].max()
avg_basepay = employees_df['BasePay'].mean()
print("The minimum Base Pay is ", min_basepay)
print("The maximum Base Pay is", max_basepay)
print("The average Base Pay is", avg_basepay)

The minimum Base Pay is  -166.01
The maximum Base Pay is 319275.01
The average Base Pay is 66325.44884050643

To replace "Not provided" in the 'EmployeeName' column with NaN (Not a Number), we used the replace() method as described in the code below:

In [43]:
employees_df['EmployeeName'].replace("Not provided", np.nan, inplace=True)
(employees_df.head())

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,San Francisco

This replaces occurrences of "Not provided" with NaN in the 'EmployeeName' column using the replace() method. The inplace=True parameter ensures that the changes are applied directly to the DataFrame.

To drop rows that have exactly 5 missing values in the dataset, the dropna() method with the thresh parameter was applied

In [44]:
employees_df.dropna(thresh=len(employees_df.columns) - 5, inplace=True)
employees_df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,San Francisco
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,San Francisco
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,San Francisco
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,San Francisco
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,San Francisco

To determine the job title of "ALBERT PARDINI" and ascertain his total compensation, including benefits, the following code was employed and is presented below.

In [45]:
albert_pardini_info = employees_df[employees_df['EmployeeName'] == 'ALBERT PARDINI']
print(" THE Job Title of ALBERT PARDINI IS", albert_pardini_info['JobTitle'].values[0])
print(" And his total Compensation  (including benefits) is", albert_pardini_info['TotalPayBenefits'].values[0])

 THE Job Title of ALBERT PARDINI IS CAPTAIN III (POLICE DEPARTMENT)
 And his total Compensation  (including benefits) is 335279.91

The following Python code was employed to pinpoint the individual with the highest base pay in the dataset.

In [47]:
highest_basepay_person = employees_df.loc[employees_df['BasePay'].idxmax()]['EmployeeName']
print("The name of the person with the highest base pay is", highest_basepay_person)

The name of the person with the highest base pay is Gregory P Suhr

In [49]:
average_basepay_per_job = employees_df.groupby('JobTitle')['BasePay'].mean()
print(" The Average Base Pay per Job Title are ")
print(average_basepay_per_job)

 The Average Base Pay per Job Title are
JobTitle
ACCOUNT CLERK                                     43300.806506
ACCOUNTANT                                        46643.172000
ACCOUNTANT INTERN                                 28732.663958
ACPO,JuvP, Juv Prob (SFERS)                       62290.780000
ACUPUNCTURIST                                     66374.400000
                                                      ...
X-RAY LABORATORY AIDE                             47664.773077
X-Ray Laboratory Aide                             46086.387100
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    52609.910000
Youth Comm Advisor                                39077.957500
ZOO CURATOR                                       43148.000000
Name: BasePay, Length: 2159, dtype: float64

In [51]:
average_basepay_accountant = employees_df[employees_df['JobTitle'] == 'Accountant']['BasePay'].mean()
print(" The Average Base Pay for Employees with Job Title 'Accountant' is ", average_basepay_accountant)

 The Average Base Pay for Employees with Job Title 'Accountant' is  nan

In [53]:
top_five_jobs = employees_df['JobTitle'].value_counts().head(5)
print(" The top five Most Common Job Title are ")
print(top_five_jobs)

 The top five Most Common Job Title are
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64


In this analysis of the Employee Salaries Dataset, the following key steps were performed:
The dataset, containing information about employees, was imported into a Pandas DataFrame and  Initial exploration using methods like head() and info() provided insights into the structure and content of the dataset. Unnecessary columns ('Notes' and 'Status') were dropped to streamline the dataset.
Instances of "Not provided" in the 'EmployeeName' column were replaced with NaN. Rows with exactly 5 missing values were also dropped to handle missing data effectively.
# Conclusion:
This analysis provided valuable insights into the Employee Salaries Dataset, ranging from basic exploratory data analysis to more detailed statistical and grouped analyses. Key findings include salary statistics, common job titles, and specific details about individuals such as "ALBERT PARDINI" and the person with the highest base pay. The code snippets were structured to enhance clarity and maintainability, facilitating a comprehensive understanding of the dataset

In [ ]:
# Sample job titles and their frequencies
job_titles = ['Software Engineer', 'Data Scientist', 'Product Manager', 'UX Designer', 'Marketing Specialist']
job_counts = [30, 20, 15, 10, 25]

# Plotting the bar chart
plt.bar(job_titles, job_counts, color='skyblue')
plt.xlabel('Job Titles')
plt.ylabel('Number of Positions')
plt.title('Job Title Visualization')
plt.xticks(rotation=45, ha='right')  # Rotate x-axis labels for better readability

# Display the plot
plt.tight_layout()
plt.show()